AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
/* SPDX-License-Identifier: Apache-2.0 */

/****************************************************************************
 * arch/arm/src/pic32czca90/sam_sqi.c
 *
 * NuttX SPI lower-half driver wrapping the PIC32CZ CA90 SQI1 peripheral.
 *
 * BD-DMA mode — production driver uses BD-DMA for all flash operations.
 *
 * Transfer model — half-duplex BDs:
 *   SQI DMA is half-duplex at the BD level.  TX BD (DIR=0) drives IO0
 *   (MOSI) and discards IO1 (MISO).  RX BD (DIR=1) clocks dummy bytes on
 *   IO0 and captures IO1 (MISO) bytes into bd_bufaddr.
 *
 *   txbuffer != NULL → TX BD: sends txbuffer bytes, rxbuffer ignored.
 *   txbuffer == NULL → RX BD: captures chunk bytes into rxbuffer.
 *
 * Flash JEDEC probe sequence (CS asserted across both):
 *   sqi_exchange(dev, cmd, NULL, 1)   — TX BD, sends 0x9F
 *   sqi_exchange(dev, NULL, id, 3)    — RX BD, captures BF 26 42
 *
 * Sequence per chunk (TX BD):
 *   1. Copy TX bytes to g_sqi_tx_buf.
 *   2. CFG |= RXBUFRST (flush RXFIFO, flush stale data).
 *   3. Fill g_sqi_tx_desc: DESC_EN|CS_ASSERT|LAST_BD|CBD_INT_EN|BUFLEN(n).
 *   4. BDBASEADD = &g_sqi_tx_desc; BDCON = START|DMAEN.
 *   5. Poll INTSTAT for BDDONE; BDCON = 0; clear INTSTAT.
 *
 * Sequence per chunk (RX BD):
 *   1. CFG |= RXBUFRST (flush RXFIFO, flush stale data).
 *   2. Fill g_sqi_rx_desc: DESC_EN|CS_ASSERT|LAST_BD|CBD_INT_EN|DIR|BUFLEN(n).
 *      bd_bufaddr = g_sqi_rx_buf (nocache).
 *   3. BDBASEADD = &g_sqi_rx_desc; BDCON = START|DMAEN.
 *   4. Poll INTSTAT for BDDONE; BDCON = 0; clear INTSTAT.
 *   5. Copy g_sqi_rx_buf[0..chunk-1] to rxbuffer.
 *
 * CS management:
 *   sqi_select(true)  — BDCON=0; drain stale RXFIFO bytes.
 *   sqi_select(false) — toggle SQIEN to force CS high.
 *   LIFM=0 in bd_ctrl — CS stays asserted between sqi_exchange() calls.
 *
 * Reference: PIC32CZ8110CA90208 component/sqi.h, instance/sqi1.h
 *
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_PIC32CZCA90_SQI1

#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <syslog.h>
#include <nuttx/cache.h>

#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "arm_internal.h"
#include "sam_gclk.h"
#include "sam_port.h"
#include "hardware/sam_gclk.h"
#include "hardware/sam_mclk.h"
#include "hardware/sam_port.h"
#include "hardware/sam_sqi.h"
#include "hardware/pic32czca90_pinmap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define SQI1_GCLK_GEN     2u
#define SQI1_GCLK_HZ      100000000u
#define SQI1_CLKDIV_50MHZ 1u

/* Max bytes per DMA chunk — BUFLEN field is 9 bits (max 511; use 256 to
 * keep well within RXFIFO depth and avoid overflow) */

#define SQI_DMA_BUF_SIZE  512u

#define SQI_DMA_TIMEOUT   500000u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct sam_sqi_dev_s
{
  struct spi_dev_s spi;
  mutex_t          lock;
  bool             cs_active;
  bool             xip_configured;  /* true after sam_sqi_xip_enable() */
  uint32_t         frequency;
  uint8_t          nbits;
  uint8_t          mode;
  size_t           pending_tx_len;  /* TX bytes staged in g_sqi_tx_buf awaiting RX or deselect */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int      sqi_lock(FAR struct spi_dev_s *dev, bool lock);
static int      sqi_dma_run(sqi_dma_desc_t *desc, size_t chunk, size_t offset);
static void     sqi_select(FAR struct spi_dev_s *dev, uint32_t devid,
                            bool selected);
static uint32_t sqi_setfrequency(FAR struct spi_dev_s *dev, uint32_t freq);
static void     sqi_setmode(FAR struct spi_dev_s *dev, enum spi_mode_e mode);
static void     sqi_setbits(FAR struct spi_dev_s *dev, int nbits);
static uint32_t sqi_send(FAR struct spi_dev_s *dev, uint32_t wd);
static void     sqi_exchange(FAR struct spi_dev_s *dev,
                              FAR const void *txbuffer,
                              FAR void *rxbuffer, size_t nwords);
static void     sqi_full_reset(void);
static void     sqi_rxbuf_invalidate(size_t nbytes);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct spi_ops_s g_sqi_ops =
{
  .lock          = sqi_lock,
  .select        = sqi_select,
  .setfrequency  = sqi_setfrequency,
  .setmode       = sqi_setmode,
  .setbits       = sqi_setbits,
  .exchange      = sqi_exchange,
  .send          = sqi_send,
};

static struct sam_sqi_dev_s g_sqi1_dev =
{
  .spi       = { .ops = &g_sqi_ops },
  .lock      = NXMUTEX_INITIALIZER,
  .frequency = 0,
  .nbits     = 8,
  .mode      = SPIDEV_MODE0,
  .cs_active = false,
};

/* Tracks whether SQI is currently in XIP (memory-mapped read) mode.
 * APB register reads while XIP+SQIEN are active stall the bus — never
 * access SQI control registers without first checking this flag. */
static volatile bool g_sqi_xip_active;

/* TX DMA descriptor and buffer — nocache for DMA coherency */

static sqi_dma_desc_t g_sqi_tx_desc
  __attribute__((section(".nocache"), aligned(32)));

static uint8_t g_sqi_tx_buf[SQI_DMA_BUF_SIZE]
  __attribute__((section(".nocache")));

/* RX DMA descriptor and buffer — nocache for DMA coherency */

static sqi_dma_desc_t g_sqi_rx_desc
  __attribute__((section(".nocache"), aligned(32)));

static uint8_t g_sqi_rx_buf[SQI_DMA_BUF_SIZE]
  __attribute__((section(".nocache")));

/****************************************************************************
 * Private Helpers
 ****************************************************************************/

static inline uint32_t sqi_getreg(uint32_t offset)
{
  return getreg32(SAM_SQI1_BASE + offset);
}

static inline void sqi_putreg(uint32_t offset, uint32_t val)
{
  putreg32(val, SAM_SQI1_BASE + offset);
}

static inline void sqi_modreg(uint32_t offset, uint32_t clr, uint32_t set)
{
  uint32_t v = getreg32(SAM_SQI1_BASE + offset);
  v = (v & ~clr) | set;
  putreg32(v, SAM_SQI1_BASE + offset);
}

static void sqi_mclk_enable(void)
{
  uint32_t id  = SAM_SQI1_MCLK_ID_AHB;
  uint32_t reg = SAM_MCLK_CLKMSK_ADDR(id);
  uint32_t bit = SAM_MCLK_CLKMSK_BIT(id);
  putreg32(getreg32(reg) | bit, reg);
}

/****************************************************************************
 * SPI Operations
 ****************************************************************************/

static int sqi_lock(FAR struct spi_dev_s *dev, bool lock)
{
  struct sam_sqi_dev_s *priv = (struct sam_sqi_dev_s *)dev;

  if (lock)
    return nxmutex_lock(&priv->lock);
  else
    return nxmutex_unlock(&priv->lock);
}

static void sqi_select(FAR struct spi_dev_s *dev, uint32_t devid,
                        bool selected)
{
  struct sam_sqi_dev_s *priv = (struct sam_sqi_dev_s *)dev;
  uint32_t cfg;

