AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
  priv->cs_active = selected;

  if (selected)
    {
      /* Ensure DMA mode for SPI transactions.  If XIP was active, disable
       * SQIEN first to cleanly exit XIP, then switch mode, then re-enable. */

      if (priv->xip_configured &&
          (sqi_getreg(SAM_SQI_CFG_OFFSET) & SQI_CFG_MODE_MASK) == SQI_CFG_MODE_XIP)
        {
          sqi_modreg(SAM_SQI_CFG_OFFSET, SQI_CFG_SQIEN, 0);
          sqi_modreg(SAM_SQI_CFG_OFFSET, SQI_CFG_MODE_MASK, SQI_CFG_MODE_DMA);
          sqi_modreg(SAM_SQI_CFG_OFFSET, 0, SQI_CFG_SQIEN);
        }

      /* Stop any in-progress DMA */

      sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
      priv->pending_tx_len = 0;

      /* Drain stale RXFIFO bytes left from previous transaction. */

      while (sqi_getreg(SAM_SQI_STAT1_OFFSET) & SQI_STAT1_RXBUFCNT_MASK)
        {
          (void)sqi_getreg(SAM_SQI_RXDATA_OFFSET);
        }
    }
  else
    {
      /* Flush any pending TX-only command (e.g. WREN, RST) that was
       * never followed by an RX phase.  Use LIFM to deassert CS. */

      if (priv->pending_tx_len > 0)
        {
          g_sqi_tx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                                      SQI_BDCTRL_LAST_BD    |
                                      SQI_BDCTRL_LIFM       |
                                      SQI_BDCTRL_CBD_INT_EN |
                                      SQI_BDCTRL_BUFLEN(priv->pending_tx_len);
          g_sqi_tx_desc.bd_stat    = 0;
          g_sqi_tx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_tx_buf;
          g_sqi_tx_desc.bd_nxtptr  = NULL;

          sqi_dma_run(&g_sqi_tx_desc, priv->pending_tx_len, 0);
          priv->pending_tx_len = 0;
        }

      /* Deassert CS0: briefly disable then re-enable SQIEN */

      cfg = sqi_getreg(SAM_SQI_CFG_OFFSET);
      sqi_putreg(SAM_SQI_CFG_OFFSET, cfg & ~SQI_CFG_SQIEN);
      sqi_putreg(SAM_SQI_CFG_OFFSET, cfg);

      /* Stay in DMA mode — don't switch back to XIP here.
       * XIP is re-entered only by qspi_xip_read/bread. */
    }
}

static uint32_t sqi_setfrequency(FAR struct spi_dev_s *dev, uint32_t freq)
{
  uint32_t divider;
  uint32_t clkdiv;
  uint32_t actual;

  if (freq == 0)
    {
      freq = 1;
    }

  divider = (SQI1_GCLK_HZ + 2u * freq - 1u) / (2u * freq);
  if (divider < 1u)
    {
      divider = 1u;
    }

  clkdiv = 1u;
  while (clkdiv < divider)
    {
      clkdiv <<= 1;
    }

  if (clkdiv > 0x400u)
    {
      clkdiv = 0x400u;
    }

  sqi_modreg(SAM_SQI_CLKCON_OFFSET,
             SQI_CLKCON_CLKDIV_MASK,
             SQI_CLKCON_CLKDIV(clkdiv));
  while ((sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE) == 0)
    {
    }

  actual = SQI1_GCLK_HZ / (2u * clkdiv);
  ((struct sam_sqi_dev_s *)dev)->frequency = actual;
  return actual;
}

static void sqi_setmode(FAR struct spi_dev_s *dev, enum spi_mode_e mode)
{
  uint32_t cfg = sqi_getreg(SAM_SQI_CFG_OFFSET) & ~(SQI_CFG_CPHA | SQI_CFG_CPOL);

  switch (mode)
    {
      case SPIDEV_MODE0:                                      break;
      case SPIDEV_MODE1: cfg |= SQI_CFG_CPHA;                break;
      case SPIDEV_MODE2: cfg |= SQI_CFG_CPOL;                break;
      case SPIDEV_MODE3: cfg |= SQI_CFG_CPHA | SQI_CFG_CPOL; break;
      default:                                                break;
    }

  sqi_putreg(SAM_SQI_CFG_OFFSET, cfg);
  ((struct sam_sqi_dev_s *)dev)->mode = (uint8_t)mode;
}

static void sqi_setbits(FAR struct spi_dev_s *dev, int nbits)
{
  ((struct sam_sqi_dev_s *)dev)->nbits = (uint8_t)nbits;
}

/****************************************************************************
 * sqi_dma_run — submit one BD chain and poll for BDDONE.
 * Returns 0 on success, -1 on timeout.
 ****************************************************************************/

static int sqi_dma_run(sqi_dma_desc_t *desc, size_t chunk, size_t offset)
{
  uint32_t timeout;

  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);
  sqi_putreg(SAM_SQI_BDBASEADD_OFFSET, (uint32_t)(uintptr_t)desc);
  sqi_putreg(SAM_SQI_BDCON_OFFSET, SQI_BDCON_START | SQI_BDCON_DMAEN);

  timeout = SQI_DMA_TIMEOUT;
  while (!(sqi_getreg(SAM_SQI_INTSTAT_OFFSET) &
           (SQI_INT_BDDONE | SQI_INT_PKTCOMP)))
    {
      if (--timeout == 0)
        {
          syslog(LOG_ERR,
                 "[sqi] DMA timeout chunk=%zu offset=%zu "
                 "INTSTAT=%08lx BDSTAT=%08lx CFG=%08lx "
                 "BDCON=%08lx STAT1=%08lx BDCURADD=%08lx\n",
                 chunk, offset,
                 (unsigned long)sqi_getreg(SAM_SQI_INTSTAT_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDSTAT_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_CFG_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDCON_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_STAT1_OFFSET),
                 (unsigned long)sqi_getreg(SAM_SQI_BDCURADD_OFFSET));
          sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
          return -1;
        }
    }

  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, sqi_getreg(SAM_SQI_INTSTAT_OFFSET));
  return 0;
}

/****************************************************************************
 * sqi_exchange — SPI exchange using linked BD chains.
 *
 * CS cannot stay LOW between separate DMA runs (hardware deasserts CS when
 * idle). To hold CS across command+response, TX bytes are staged in
 * g_sqi_tx_buf. When RX is requested (txbuffer==NULL), a linked TX→RX BD
 * chain is submitted atomically (same pattern as sam_sqi_flash_cmd_read).
 *
 * Patterns:
 *   exchange(cmd, NULL, 1)    — stage TX (no DMA yet)
 *   exchange(NULL, data, n)   — execute linked TX→RX chain, CS held
 *   select(false)             — flush any pending TX-only (e.g. WREN)
 *   exchange(tx, rx, 1)       — spi_send: single TX BD + drain RXFIFO
 ****************************************************************************/

static void sqi_exchange(FAR struct spi_dev_s *dev,
                          FAR const void *txbuffer,
                          FAR void *rxbuffer, size_t nwords)
{
  struct sam_sqi_dev_s *priv = (struct sam_sqi_dev_s *)dev;
  const uint8_t *tx  = (const uint8_t *)txbuffer;
  uint8_t       *rx  = (uint8_t *)rxbuffer;
  size_t         i;

  if (tx && rx)
    {
      /* Full-duplex (SPI_SEND path).
       *
       * SAFETY: Replay is only safe for READ commands (RDID, RDSR).
       * For WRITE commands (erase, program), intermediate replays with
       * WEL set could accidentally execute at wrong addresses.
       *
       * Strategy:
       *   Read commands (0x9F, 0x05, 0x35): replay TX(1:cmd)→RX(N)
       *   Write/other: just stage bytes, return 0xFF (caller discards) */

      for (i = 0; i < nwords && priv->pending_tx_len < SQI_DMA_BUF_SIZE; i++)
        {
          g_sqi_tx_buf[priv->pending_tx_len++] = tx[i];
        }

      uint8_t cmd = g_sqi_tx_buf[0];
      bool is_read_cmd = (cmd == 0x9Fu || cmd == 0x05u || cmd == 0x35u);

      if (!is_read_cmd || priv->pending_tx_len <= 1)
        {
          /* Write command or first byte: stage only, return 0xFF. */

