AMzeo/nuttx/arch/arm/src/pic32czca90/sam_sqi.c
  /* 6. Enable clock and wait for stable */

  sqi_putreg(SAM_SQI_CLKCON_OFFSET, SQI_CLKCON_EN);
  while ((sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE) == 0)
    {
    }

  /* 7. Set clock divider: CLKDIV=1 → 100 MHz / 2 = 50 MHz SCK */

  sqi_modreg(SAM_SQI_CLKCON_OFFSET,
             SQI_CLKCON_CLKDIV_MASK,
             SQI_CLKCON_CLKDIV(SQI1_CLKDIV_50MHZ));
  while ((sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE) == 0)
    {
    }


  /* 8. Enable SQI block */

  sqi_modreg(SAM_SQI_CFG_OFFSET, 0, SQI_CFG_SQIEN);

  /* 9. CMDTHR: RXCMDTHR=1 so DMA can consume RXFIFO with as few as 1 byte.
   *    Higher values stall on short transfers (e.g. 3-byte JEDEC). */

  sqi_putreg(SAM_SQI_CMDTHR_OFFSET,
             SQI_CMDTHR_RXCMDTHR(0x01u) | SQI_CMDTHR_TXCMDTHR(0x01u));

  /* 10. INTTHR = 1 for both RX and TX */

  sqi_putreg(SAM_SQI_INTTHR_OFFSET,
             SQI_INTTHR_RXINTTHR(0x01u) | SQI_INTTHR_TXINTTHR(0x01u));

  /* 11. THR = 1 */

  sqi_putreg(SAM_SQI_THR_OFFSET, SQI_THR_THRES(1u));

  /* 12. Enable internal events so INTSTAT reflects BDDONE/PKTCOMP (polled) */

  sqi_putreg(SAM_SQI_INTEN_OFFSET,
             SQI_INTEN_BDDONEIE | SQI_INTEN_PKTCOMPIE);
  sqi_putreg(SAM_SQI_INTSIGEN_OFFSET,
             SQI_INTSIGEN_BDDONEISE | SQI_INTSIGEN_PKTCOMPISE);

  /* 13. Clear BDCON and any stale interrupt flags */

  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);

  priv->frequency = 50000000u;
  return &priv->spi;
}

/****************************************************************************
 * Public Function: sam_sqi_xip_enable
 *
 * Configure XIP mode for SST26 Regular Read (0x03): single-lane,
 * 3-byte address, no dummy.  After this call, flash data is accessible
 * at SAM_SQI1_XIP_BASE (0x90000000) + offset.
 ****************************************************************************/

void sam_sqi_xip_enable(void)
{
  struct sam_sqi_dev_s *priv = &g_sqi1_dev;

  sqi_putreg(SAM_SQI_XCON1_OFFSET, SQI_XCON1_SST26_READ);
  sqi_putreg(SAM_SQI_XCON2_OFFSET, SQI_XCON2_SST26_CS0);
  sqi_modreg(SAM_SQI_CFG_OFFSET, SQI_CFG_MODE_MASK, SQI_CFG_MODE_XIP);
  priv->xip_configured = true;
  g_sqi_xip_active = true;
}

void sam_sqi_enter_xip(void)
{
  uint32_t cfg;
  irqstate_t flags;

  /* If already in XIP mode, APB register access would stall the bus.
   * Skip reconfiguration entirely — the controller is already set up. */

  if (g_sqi_xip_active)
    {
      return;
    }

  cfg = sqi_getreg(SAM_SQI_CFG_OFFSET);
  flags = enter_critical_section();

  /* 1. Stop DMA, clear any pending state */

  sqi_putreg(SAM_SQI_BDCON_OFFSET, 0);
  sqi_putreg(SAM_SQI_INTSTAT_OFFSET, 0xFFFFFFFFu);

  /* 2. Disable SQIEN (SQI goes inactive — no bus activity) */

  cfg = sqi_getreg(SAM_SQI_CFG_OFFSET);
  sqi_putreg(SAM_SQI_CFG_OFFSET, cfg & ~SQI_CFG_SQIEN);

  /* 3. Re-configure XIP registers (SWRST in cmd_write/cmd_read clears these) */

  sqi_putreg(SAM_SQI_XCON1_OFFSET, SQI_XCON1_SST26_READ);
  sqi_putreg(SAM_SQI_XCON2_OFFSET, SQI_XCON2_SST26_CS0);

  /* 4. Restore CLKCON (XIP mode clears CLKDIV per hardware behavior doc 6b)
   *    Timeout prevents infinite hang if peripheral is in bad state. */

  sqi_putreg(SAM_SQI_CLKCON_OFFSET, SQI_CLKCON_EN);
  {
    volatile uint32_t tout = 100000u;
    while (!(sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE))
      {
        if (--tout == 0)
          {
            /* Clock stuck — force SWRST and retry */
            leave_critical_section(flags);
            sqi_full_reset();
            flags = enter_critical_section();
            sqi_putreg(SAM_SQI_XCON1_OFFSET, SQI_XCON1_SST26_READ);
            sqi_putreg(SAM_SQI_XCON2_OFFSET, SQI_XCON2_SST26_CS0);
            sqi_putreg(SAM_SQI_CLKCON_OFFSET, SQI_CLKCON_EN);
            tout = 100000u;
          }
      }
  }
  sqi_putreg(SAM_SQI_CLKCON_OFFSET,
             SQI_CLKCON_EN | SQI_CLKCON_CLKDIV(SQI1_CLKDIV_50MHZ));
  {
    volatile uint32_t tout = 100000u;
    while (!(sqi_getreg(SAM_SQI_CLKCON_OFFSET) & SQI_CLKCON_STABLE))
      {
        if (--tout == 0) break;
      }
  }

  __asm__ volatile ("dsb sy" ::: "memory");

  /* 5. Switch MODE to XIP + enable SQIEN */

  sqi_putreg(SAM_SQI_CFG_OFFSET,
             SQI_CFG_MODE_XIP | SQI_CFG_BURSTEN |
             SQI_CFG_DATAEN(0) | SQI_CFG_CSEN0 | SQI_CFG_SQIEN);

  __asm__ volatile ("dsb sy\n isb sy" ::: "memory");

  g_sqi_xip_active = true;

  leave_critical_section(flags);
}

/****************************************************************************
 * Public Function: sam_sqi_flash_cmd_write
 *
 * Send a flash command as a single standalone TX BD with LIFM.
 * All bytes in txbuf are shifted out on IO0, then CS deasserts (LIFM).
 * Used for: WREN (1B), Sector Erase (4B), Page Program (4+256B).
 *
 * Ensures DMA mode, submits BD, polls PKTCOMP, returns to XIP.
 * Returns 0 on success, -EIO on timeout.
 ****************************************************************************/

int sam_sqi_flash_cmd_write(FAR const uint8_t *txbuf, size_t txlen)
{
  uint32_t timeout;
  size_t i;

  if (txlen == 0 || txlen > SQI_DMA_BUF_SIZE)
    {
      return -EINVAL;
    }

  /* SWRST + full reinit — clears BD processor cache (Michigan Ax) */

  sqi_full_reset();

  /* Force CS HIGH between commands (t_CSH >= 50 ns for SST26) */

  {
    uint32_t c = sqi_getreg(SAM_SQI_CFG_OFFSET);
    volatile int _dly;
    sqi_putreg(SAM_SQI_CFG_OFFSET, c & ~SQI_CFG_SQIEN);
    for (_dly = 0; _dly < 50; _dly++) { __asm__ volatile ("nop"); }
    sqi_putreg(SAM_SQI_CFG_OFFSET, c);
  }

  /* Copy TX data */

  for (i = 0; i < txlen; i++)
    {
      g_sqi_tx_buf[i] = txbuf[i];
    }

  /* Set up BD descriptor */

  g_sqi_tx_desc.bd_ctrl    = SQI_BDCTRL_DESC_EN   |
                              SQI_BDCTRL_LAST_BD    |
                              SQI_BDCTRL_LIFM       |
                              SQI_BDCTRL_PKT_INT_EN |
                              SQI_BDCTRL_BUFLEN(txlen);
  g_sqi_tx_desc.bd_stat    = 0;
  g_sqi_tx_desc.bd_bufaddr = (uint32_t)(uintptr_t)g_sqi_tx_buf;
  g_sqi_tx_desc.bd_nxtptr  = NULL;

  /* Flush D-Cache for TX buffer + descriptor (no MPU nocache region yet) */

  {
    uintptr_t addr;
    for (addr = (uintptr_t)g_sqi_tx_buf & ~31u;
         addr < (uintptr_t)g_sqi_tx_buf + txlen;
         addr += 32)
      putreg32(addr, 0xE000EF68u);  /* DCCMVAC */
    for (addr = (uintptr_t)&g_sqi_tx_desc & ~31u;
         addr < (uintptr_t)&g_sqi_tx_desc + 32;
         addr += 32)
      putreg32(addr, 0xE000EF68u);
    __asm__ volatile ("dsb sy" ::: "memory");
  }


  /* Submit BD */

